---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotDimStyleSlopeUnits
source: html/918e34f9-8271-788c-2e20-24c2cb064449.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotDimStyleSlopeUnits Property

"Units Format"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotDimStyleSlopeUnits { get; }
```